
==================
Comment (line) 
==================

// single line comment
---

(source_file
  (comment))

==================
Block Comment 
==================

/* single line block */
---

(source_file
  (block_comment))


==================
Block Comment removing property 1
==================

DataModule
	/*ModuleName = Browncoats*/
	IsFaction = 1

---

(source_file
	(dataModule
		(block_comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Block Comment removing property 2
==================

DataModule
	/*
	ModuleName = Browncoats
	*/
	IsFaction = 1

---

(source_file
	(dataModule
		(block_comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Line Comment removing property
==================

DataModule
	//ModuleName = Browncoats
	IsFaction = 1

---

(source_file
	(dataModule
		(comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Line Comment Divider ("/////")
==================

DataModule
	IsFaction = 1
///////////////
	IsFaction = 1

---

(source_file
	(dataModule
		(statement
			(property)
			(number)
		)
		(comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Empty Line comment (mid-block)
==================

DataModule
	IsFaction = 1
	//
	IsFaction = 1

---

(source_file
	(dataModule
		(statement
			(property)
			(number)
		)
		(comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Empty Line comment (pre)
==================

//
DataModule
	IsFaction = 1
	IsFaction = 1

---

(source_file
	(comment)
	(dataModule
		(statement
			(property)
			(number)
		)
		(statement
			(property)
			(number)
		)
	)
)

==================
Empty Line comment (post)
==================

DataModule
	IsFaction = 1
	IsFaction = 1
//

---

(source_file
	(dataModule
		(statement
			(property)
			(number)
		)
		(statement
			(property)
			(number)
		)
		(comment)
	)
)


==================
Consecutive Line Comments
==================

DataModule
//  IsFaction = 1
//  IsFaction = 1
	IsFaction = 1

---

(source_file
	(dataModule
		(comment)
		(comment)
		(statement
			(property)
			(number)
		)
	)
)


==================
Consecutive Line Comments (Spacer)
==================

DataModule
//  IsFaction = 1
/////////////
	IsFaction = 1

---

(source_file
	(dataModule
		(comment)
		(comment)
		(statement
			(property)
			(number)
		)
	)
)


==================
Consecutive Block Comments
==================

DataModule
/* */
/* */
	IsFaction = 1

---

(source_file
	(dataModule
		(block_comment)
		(block_comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Mixed comments: Line then block
==================

DataModule
	//ModuleName = /*Browncoats
	IsFaction = 1
  */
---

(source_file
	(dataModule
		(block_comment)
	)
)

==================
Mixed comments: Block then Line
==================

DataModule
	/*ModuleName = //Browncoats */
	IsFaction = 1
---

(source_file
	(dataModule
		(block_comment)
		(statement
			(property)
			(number)
		)
	)
)

==================
Unclosed Block Comment
==================

DataModule
	/*
	IsFaction = 1
---

(source_file
	(dataModule(
		(block_comment))
	)
)

